In [4]:
import pandas as pd 
d = {"customer": ["A", "B", "C", "D"], "sales":[1100, 950.75, "$$$-400", "$1250.35*"]}
df = pd.DataFrame(d)
df

  customer      sales
0        A       1100
1        B     950.75
2        C    $$$-400
3        D  $1250.35*

In [42]:
# Step 1: check the data types
df["sales"].apply(type)

0      <class 'int'>
1    <class 'float'>
2      <class 'str'>
3      <class 'str'>
Name: sales, dtype: object

In [2]:
# Step 2: use regex
df["sales"] = df["sales"].replace("[$\-\_\*]", "", regex = True).astype("float")
df

  customer    sales
0        A  1100.00
1        B   950.75
2        C   400.00
3        D  1250.35

In [5]:
df["sales"].str.strip("$*").astype("float")

0        NaN
1        NaN
2    -400.00
3    1250.35
Name: sales, dtype: float64